mod4-project-backend/app/controllers/transactions_controller.rb

    def index
        transact = Transaction.all
---
SELECT "transactions".* FROM "transactions"

    def create
        transact = Transaction.create(transact_params)
---
INSERT INTO "transactions" ("created_at", "updated_at", "name", "amount", "t_date", "category_id", "transaction_type_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def update
        @transaction.update(transact_params)
---
UPDATE "transactions" SET "name" = $1, "transaction_type_id" = $2, "updated_at" = $3 WHERE "transactions"."id" = $4  [["name", "Debit Entry (changed to credit)"], ["transaction_type_id", 1], ["updated_at", "2020-10-18 00:59:02.129443"], ["id", 31]]

    def destroy
        transact = @transaction.destroy
---
DELETE FROM "transactions" WHERE "transactions"."id" = $1  [["id", 13]]

    def find_transaction
        @transaction = Transaction.find(params[:id])
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]