mod4-project-backend/app/controllers/transaction_types_controller.rb

    def index
        t_types = TransactionType.all
---
SELECT "transaction_types".* FROM "transaction_types"