mod4-project-backend/app/controllers/users_controller.rb

UPDATE "users" SET "address" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["address", "2019 Broadway, New York, NY 10025"], ["updated_at", "2020-10-17 23:47:21.789477"], ["id", 2]]
---
    def update
        @user.update(user_params)