mod4-project-backend/app/serializers/user_serializer.rb

SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1  [["user_id", 1]]
---
    def account_balance
        self.object.transactions.select{|e|e.transaction_type_id == 1}.sum{|e|e.amount} - self.object.transactions.select{|e|e.transaction_type_id == 2}.sum{|e|e.amount}

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1  [["user_id", "1"]]
SELECT "banks".* FROM "banks" WHERE "banks"."account_id" = $1  [["account_id", 1]]
---
    def banks
        self.object.accounts.map{|e| e.banks}.flatten

SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1  [["user_id", 1]]
---
    def credit_categories
        self.object.transactions.select{|e|e.transaction_type.id == 1}.map{|e|e.category}.uniq

SELECT "transaction_types".* FROM "transaction_types"
---
    def debit_categories
        self.object.transactions.select{|e|e.transaction_type.id == 2}.map{|e|e.category}.uniq